In [140]:
import pandas as pd
import numpy as np

In [141]:
import matplotlib.pyplot as plt
import seaborn as sns

In [142]:
df =pd.read_csv(r"C:\Users\omkar\OneDrive\Desktop\OS\segAI\customer_segmentation.csv")

In [143]:
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [144]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [145]:
df.duplicated().sum()  # Used to check duplicates rows

np.int64(0)

In [146]:
df=df.drop_duplicates() # it is used to drop duplicate rows in dataset
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [147]:
df.isnull().sum() # here No null value

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [148]:
df['Education'].unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

In [149]:
df['Education'] = df['Education'].replace({'PhD':'Phd','2n Cycle':'Second Cycle'})
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,Phd,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,Phd,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,Phd,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [150]:
df['Education'].unique()

array(['Graduation', 'Phd', 'Master', 'Basic', 'Second Cycle'],
      dtype=object)

In [151]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

In [152]:
df['Marital_Status'].unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow', 'Alone',
       'Absurd', 'YOLO'], dtype=object)

In [153]:
df['Marital_Status'] = df['Marital_Status'].replace({'Alone':'Single'})
df['Marital_Status'] = df['Marital_Status'].replace({'Together':'Married'})
df['Marital_Status'] = df['Marital_Status'].replace(['Absurd','YOLO'])
df

C:\Users\omkar\AppData\Local\Temp\ipykernel_26380\1710011123.py:3: FutureWarning: Series.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df['Marital_Status'] = df['Marital_Status'].replace(['Absurd','YOLO'])

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Married,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Married,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,Phd,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,Phd,Married,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Married,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,Phd,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [154]:
df['Marital_Status'].unique()

array(['Single', 'Married', 'Divorced', 'Widow'], dtype=object)

In [155]:
df["Income"].unique()

array([58138., 46344., 71613., ..., 56981., 69245., 52869.], shape=(1975,))

In [156]:
Income_mean = df["Income"].mean().round(0) # here the mean (average value of all income value)

In [157]:
df["Income"] = df["Income"].fillna(Income_mean) # fillna is used for fill the null values
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Married,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Married,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,Phd,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,Phd,Married,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Married,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,Phd,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [158]:
df.isnull().sum() # here No null value

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [159]:
df["Kidhome"].unique()

array([0, 1, 2])

In [160]:
df["Teenhome"].unique()

array([0, 1, 2])

In [162]:
df["Dt_Customer"].unique()

array(['04-09-2012', '08-03-2014', '21-08-2013', '10-02-2014',
       '19-01-2014', '09-09-2013', '13-11-2012', '08-05-2013',
       '06-06-2013', '13-03-2014', '15-11-2013', '10-10-2012',
       '24-11-2012', '24-12-2012', '31-08-2012', '28-03-2013',
       '03-11-2012', '08-08-2012', '06-01-2013', '23-12-2012',
       '11-01-2014', '18-03-2013', '02-01-2013', '27-05-2013',
       '20-02-2013', '31-05-2013', '22-11-2013', '22-05-2014',
       '11-05-2013', '29-10-2012', '29-08-2013', '31-12-2013',
       '02-09-2013', '11-02-2014', '01-02-2013', '29-04-2013',
       '12-03-2013', '05-11-2013', '02-10-2013', '28-06-2014',
       '09-11-2012', '24-05-2013', '01-01-2014', '08-11-2012',
       '12-05-2014', '11-08-2012', '07-06-2014', '12-06-2013',
       '19-11-2012', '02-04-2013', '28-04-2014', '17-06-2013',
       '03-03-2014', '04-07-2013', '07-09-2012', '18-02-2013',
       '11-06-2013', '06-12-2013', '21-05-2013', '11-05-2014',
       '19-03-2014', '27-09-2013', '08-04-2013', '11-09-2012',
       '14-09-2012', '17-03-2013', '05-04-2013', '30-04-2014',
       '19-12-2012', '27-08-2012', '12-10-2012', '04-09-2013',
       '29-08-2012', '23-06-2013', '03-07-2013', '25-02-2014',
       '11-08-2013', '16-07-2013', '28-05-2014', '21-01-2014',
       '27-05-2014', '23-11-2013', '23-03-2014', '24-05-2014',
       '22-11-2012', '11-04-2013', '01-12-2013', '20-06-2013',
       '23-07-2013', '30-03-2014', '20-04-2013', '17-05-2013',
       '08-05-2014', '10-12-2013', '24-09-2013', '02-02-2013',
       '07-12-2012', '02-11-2013', '10-11-2012', '25-06-2014',
       '12-12-2012', '10-09-2013', '24-01-2014', '19-02-2013',
       '11-07-2013', '14-11-2013', '24-02-2014', '22-04-2013',
       '21-04-2013', '08-06-2014', '10-05-2014', '30-09-2013',
       '10-03-2013', '14-08-2013', '07-07-2013', '19-05-2014',
       '28-07-2013', '19-10-2012', '19-04-2013', '28-08-2013',
       '19-03-2013', '18-10-2012', '28-10-2012', '22-08-2012',
       '21-06-2014', '24-04-2014', '07-03-2014', '14-12-2012',
       '09-10-2012', '08-07-2013', '12-09-2013', '17-10-2013',
       '20-08-2013', '01-07-2013', '05-11-2012', '05-01-2014',
       '01-05-2013', '01-03-2014', '13-11-2013', '18-11-2013',
       '21-04-2014', '13-07-2013', '30-01-2014', '04-04-2014',
       '12-09-2012', '16-12-2012', '23-05-2014', '24-06-2014',
       '28-09-2013', '22-01-2014', '15-06-2014', '05-12-2012',
       '02-08-2013', '23-02-2013', '09-09-2012', '26-09-2013',
       '30-05-2013', '29-12-2013', '13-05-2014', '19-09-2013',
       '17-01-2013', '31-03-2014', '29-06-2014', '09-12-2013',
       '14-10-2013', '02-11-2012', '17-07-2013', '08-12-2013',
       '13-05-2013', '10-09-2012', '31-03-2013', '18-03-2014',
       '05-10-2012', '21-01-2013', '04-05-2013', '01-04-2014',
       '31-08-2013', '14-11-2012', '11-04-2014', '14-04-2014',
       '05-01-2013', '08-09-2012', '26-03-2013', '25-10-2012',
       '09-12-2012', '16-02-2014', '20-03-2013', '15-05-2013',
       '16-04-2014', '23-03-2013', '04-12-2013', '04-10-2013',
       '26-12-2013', '17-05-2014', '28-10-2013', '31-07-2013',
       '28-11-2013', '17-08-2012', '05-06-2014', '20-05-2013',
       '09-01-2013', '16-09-2013', '27-10-2013', '22-09-2012',
       '13-10-2012', '16-10-2012', '22-10-2012', '04-06-2013',
       '22-05-2013', '17-06-2014', '23-11-2012', '03-02-2013',
       '14-03-2013', '26-06-2014', '15-10-2012', '19-06-2013',
       '20-03-2014', '04-02-2014', '06-04-2014', '06-02-2013',
       '11-02-2013', '17-04-2014', '12-07-2013', '29-01-2013',
       '08-01-2013', '13-06-2013', '27-12-2013', '31-10-2012',
       '15-01-2014', '23-08-2012', '07-03-2013', '13-01-2013',
       '12-01-2013', '17-03-2014', '12-10-2013', '13-04-2014',
       '18-09-2012', '05-03-2014', '27-04-2013', '18-01-2014',
       '03-06-2013', '17-12-2013', '11-03-2014', '29-07-2013',
       '14-08-2012', '23-08-2013', '09-02-2014', '07-02-2013',
       '11-01-2013', '05-07-2013', '02-07-2013', '07-11-2013',
       '09-05-2013', '13-02-2013', '16-04-2013', '11-09-2013',
       '03-04-2013', '10-01-2013', '30-06-2013', '06-12-2012',
       '12-11-2012', '03-03-2013', '10-08-2012', '07-12-2013',
       '15-08-2013', '10-11-2013', '16-06-2014', '25-12-2012',
       '03-01-2014', '27-10-2012', '22-12-2012', '29-11-2013',
       '08-10-2013', '28-09-2012', '22-03-2014', '28-12-2012',
       '21-08-2012', '16-03-2013', '17-11-2012', '01-12-2012',
       '22-04-2014', '11-11-2012', '22-06-2013', '18-08-2012',
       '30-12-2012', '14-06-2013', '16-10-2013', '30-08-2012',
       '04-05-2014', '18-04-2013', '06-10-2013', '15-09-2012',
       '27-09-2012', '11-03-2013', '22-10-2013', '09-06-2014',
       '30-05-2014', '17-10-2012', '30-03-2013', '23-01-2013',
       '20-11-2013', '14-02-2014', '22-02-2013', '05-03-2013',
       '06-05-2014', '13-04-2013', '05-04-2014', '25-04-2013',
       '25-11-2013', '02-02-2014', '21-06-2013', '21-12-2013',
       '07-09-2013', '22-08-2013', '20-12-2013', '06-08-2013',
       '09-10-2013', '09-06-2013', '22-12-2013', '02-05-2013',
       '16-02-2013', '20-08-2012', '01-04-2013', '25-05-2014',
       '25-09-2012', '22-09-2013', '28-01-2014', '23-04-2013',
       '06-03-2014', '15-08-2012', '27-03-2013', '10-10-2013',
       '04-08-2012', '18-05-2014', '09-05-2014', '23-10-2012',
       '30-12-2013', '19-08-2012', '30-10-2013', '26-06-2013',
       '26-01-2014', '24-09-2012', '03-12-2012', '27-11-2013',
       '06-08-2012', '29-12-2012', '24-08-2012', '07-11-2012',
       '02-12-2013', '19-07-2013', '25-05-2013', '20-10-2013',
       '14-04-2013', '27-01-2014', '16-08-2013', '30-09-2012',
       '04-12-2012', '12-08-2012', '03-11-2013', '15-02-2013',
       '18-09-2013', '18-06-2014', '24-04-2013', '15-02-2014',
       '08-08-2013', '23-12-2013', '28-11-2012', '07-08-2013',
       '07-01-2014', '03-12-2013', '29-03-2014', '08-04-2014',
       '07-02-2014', '06-11-2013', '01-03-2013', '03-08-2013',
       '16-06-2013', '25-06-2013', '13-09-2013', '01-08-2013',
       '31-01-2013', '09-07-2013', '15-04-2013', '03-04-2014',
       '18-04-2014', '23-09-2012', '14-09-2013', '26-10-2012',
       '19-10-2013', '21-02-2013', '17-09-2013', '26-01-2013',
       '07-05-2014', '19-08-2013', '18-07-2013', '11-12-2012',
       '26-07-2013', '06-05-2013', '14-07-2013', '10-03-2014',
       '28-12-2013', '20-01-2013', '21-09-2012', '06-09-2012',
       '18-12-2012', '19-11-2013', '13-06-2014', '07-05-2013',
       '18-08-2013', '13-12-2013', '17-02-2014', '03-08-2012',
       '04-01-2014', '21-10-2013', '25-12-2013', '01-01-2013',
       '16-05-2013', '25-09-2013', '08-11-2013', '16-12-2013',
       '30-10-2012', '02-01-2014', '18-10-2013', '25-07-2013',
       '24-10-2013', '19-12-2013', '16-05-2014', '04-10-2012',
       '25-08-2013', '29-05-2013', '26-03-2014', '09-04-2014',
       '12-03-2014', '29-04-2014', '27-06-2014', '10-04-2013',
       '21-11-2013', '21-10-2012', '14-05-2013', '01-08-2012',
       '25-01-2014', '11-10-2013', '07-08-2012', '29-03-2013',
       '03-06-2014', '09-08-2012', '06-03-2013', '12-05-2013',
       '09-03-2014', '15-09-2013', '29-01-2014', '03-10-2013',
       '28-02-2013', '02-05-2014', '09-02-2013', '15-03-2013',
       '10-05-2013', '05-09-2012', '01-09-2013', '26-05-2013',
       '12-12-2013', '08-12-2012', '30-08-2013', '18-12-2013',
       '18-06-2013', '29-05-2014', '15-01-2013', '29-10-2013',
       '02-03-2013', '14-12-2013', '19-01-2013', '06-04-2013',
       '04-11-2013', '22-03-2013', '31-05-2014', '04-02-2013',
       '05-05-2013', '14-02-2013', '21-03-2014', '05-08-2013',
       '29-11-2012', '27-07-2013', '13-01-2014', '29-09-2012',
       '23-10-2013', '06-11-2012', '26-05-2014', '04-03-2014',
       '06-01-2014', '11-06-2014', '19-06-2014', '26-11-2012',
       '11-12-2013', '14-01-2014', '23-01-2014', '24-03-2013',
       '29-06-2013', '25-01-2013', '17-11-2013', '18-05-2013',
       '17-04-2013', '24-01-2013', '09-08-2013', '10-06-2013',
       '20-07-2013', '28-05-2013', '04-03-2013', '01-10-2012',
       '10-02-2013', '14-10-2012', '03-02-2014', '22-06-2014',
       '25-10-2013', '18-02-2014', '09-11-2013', '13-08-2013',
       '25-08-2012', '19-04-2014', '07-04-2014', '03-01-2013',
       '04-11-2012', '22-01-2013', '26-02-2014', '23-04-2014',
       '30-07-2013', '13-10-2013', '27-11-2012', '01-05-2014',
       '30-11-2012', '17-08-2013', '04-01-2013', '03-05-2014',
       '26-04-2014', '02-06-2014', '26-10-2013', '24-03-2014',
       '25-02-2013', '20-09-2013', '16-01-2013', '24-12-2013',
       '18-11-2012', '05-08-2012', '03-05-2013', '12-11-2013',
       '06-07-2013', '21-07-2013', '20-10-2012', '23-05-2013',
       '26-08-2012', '12-01-2014', '13-02-2014', '27-02-2014',
       '20-04-2014', '28-06-2013', '28-04-2013', '21-03-2013',
       '27-08-2013', '30-07-2012', '05-12-2013', '08-02-2013',
       '21-11-2012', '26-02-2013', '20-09-2012', '08-06-2013',
       '05-09-2013', '12-04-2014', '24-06-2013', '19-02-2014',
       '27-12-2012', '01-11-2012', '22-07-2013', '31-01-2014',
       '26-08-2013', '01-10-2013', '10-06-2014', '01-02-2014',
       '03-09-2012', '26-09-2012', '31-07-2012', '02-12-2012',
       '05-05-2014', '06-10-2012', '02-03-2014', '15-05-2014',
       '10-12-2012', '13-08-2012', '23-02-2014', '16-03-2014',
       '21-09-2013', '24-10-2012', '15-10-2013', '17-02-2013',
       '28-08-2012', '12-02-2014', '08-02-2014', '01-09-2012',
       '16-11-2012', '12-02-2013', '02-08-2012', '16-08-2012',
       '25-11-2012', '27-04-2014', '30-04-2013', '20-11-2012',
       '14-06-2014', '28-03-2014', '08-03-2013', '02-09-2012',
       '15-04-2014', '25-04-2014', '27-06-2013', '01-06-2013',
       '05-10-2013', '22-02-2014', '12-04-2013', '23-09-2013',
       '24-07-2013', '23-06-2014', '10-01-2014', '25-03-2013',
       '17-01-2014', '04-06-2014', '25-03-2014', '31-12-2012',
       '19-09-2012', '27-02-2013', '02-10-2012', '09-04-2013',
       '02-04-2014', '07-01-2013', '26-11-2013', '04-08-2013',
       '17-12-2012', '06-06-2014', '19-05-2013', '12-08-2013',
       '15-12-2013', '07-10-2012', '06-09-2013', '15-07-2013',
       '27-01-2013', '05-02-2014', '26-12-2012', '06-02-2014',
       '14-01-2013', '20-06-2014', '24-08-2013', '28-02-2014',
       '07-04-2013', '10-04-2014', '12-06-2014', '30-11-2013',
       '09-03-2013', '27-03-2014', '15-12-2012', '17-09-2012',
       '02-06-2013', '21-12-2012', '01-11-2013', '10-08-2013',
       '11-10-2012', '20-12-2012', '09-01-2014'], dtype=object)

In [163]:
df["Recency"].unique()

array([58, 38, 26, 94, 16, 34, 32, 19, 68, 11, 59, 82, 53, 23, 51, 20, 91,
       86, 41, 42, 63,  0, 69, 89,  4, 96, 56, 31,  8, 55, 37, 76, 99,  3,
       88, 80, 72, 24, 92, 39, 29,  2, 54, 57, 30, 12, 18, 75, 90,  1, 25,
       40,  9, 87,  5, 95, 48, 70, 79, 45, 84, 44, 43, 35, 15, 17, 46, 27,
       74, 85, 65, 13, 83, 10, 21, 61, 73, 47, 36, 49, 28, 64, 98, 78, 77,
       81, 14, 52, 93, 50, 60, 66, 97, 62,  6, 33, 67, 22, 71,  7])

In [164]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2240 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [166]:
df.head(10)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Married,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Married,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,Phd,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
5,7446,1967,Master,Married,62513.0,0,1,09-09-2013,16,520,...,6,0,0,0,0,0,0,3,11,0
6,965,1971,Graduation,Divorced,55635.0,0,1,13-11-2012,34,235,...,6,0,0,0,0,0,0,3,11,0
7,6177,1985,Phd,Married,33454.0,1,0,08-05-2013,32,76,...,8,0,0,0,0,0,0,3,11,0
8,4855,1974,Phd,Married,30351.0,1,0,06-06-2013,19,14,...,9,0,0,0,0,0,0,3,11,1
9,5899,1950,Phd,Married,5648.0,1,1,13-03-2014,68,28,...,20,1,0,0,0,0,0,3,11,0

In [167]:
df.isnull().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [169]:
df.duplicated().sum()

np.int64(0)